execution_jmeter_.yml
execution:
- executor: jmeter
  scenario: blazedemo
  concurrency:
    local: 50
    cloud: 200
  hold-for: 2m
  ramp-up: 60s
  locations:
    us-west-1: 1
    us-east-1: 2
- executor: jmeter
  scenario: blazedemo
  concurrency:
    local: 1
    cloud: 100
  hold-for: 5m
  ramp-up: 120
  locations:
    us-east-2: 2

reporting:
- module: final-stats
  summary: true
  dump-xml: stats.xml