execution_jmeter__.yml
execution:
- executor: jmeter
  scenario: blazedemo
  concurrency:
    local: 50
    cloud: 200
  hold-for: 2m
  ramp-up: 30s
  locations:
    us-west-1: 1
    us-east-1: 2
- executor: jmeter
  scenario: blazedemo
  concurrency:
    local: 50
    cloud: 300
  hold-for: 30s
  ramp-up: 2m
  locations:
    ap-south-1: 1
  # locations-weighted: false


reporting:
- module: final-stats
  summary: true
  dump-xml: stats.xml

settings:
  artifacts-dir: ./artifacts/%Y-%m-%d_%H-%M-%S.%f

modules:
  cloud:
    token: 26de64a5cb90ac02f3fb3bb9:4d6bde6c67d1030beea996222b4ce3fb22d0c3ad9860fe7c2ee502512715f0044d2025c2
    test: 'Taurus from Scenario'
    report-name: 'Taurus from Scenario'